// # Модуль 1. Заняття 2. Розгалуження. Цикли
//
// ## Example 1 - Введення користувача та розгалуження
//
// Використовуючи конструкцію if..else та prompt, напиши код, який питатиме:
// `"Яка офіційна назва JavaScript?"`. Якщо користувач вводить
// `ECMAScript`, то показуй alert з рядком `"Правильно!"`, в іншому випадку -
// `"Не знаєте? ECMAScript!"`
//
// --- your code here ---
// --- end of code ---
//
// ## Example 2 - Відображення часу (if...else)
//
// Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка
// формату `"14 г. 26 хв."`. Якщо значення змінної `minutes` дорівнює `0`, то
// виводь рядок `"14 г."`, без хвилин.
//
// --- your code here ---
// const hours = 14;
// const minutes = 26;
// let timestring;
//
// console.log(timestring);
// --- end of code ---
//
// ## Example 3 - Розгалуження
//
// Напиши скрипт, який виводить у консоль рядок `"Це позитивне число"`,
// якщо у prompt користувач ввів число більше нуля. Якщо було введено нуль, виводь
// в консоль рядок `"Це нуль"`. Якщо передали від'ємне число, у консолі
// повинен бути рядок `"Це негативне число"`.
//
// --- your code here ---
// const userInput = prompt('Введіть число');
// --- end of code ---
//
// ## Example 4 - Вкладені розгалуження
//
// Напиши скрипт, який порівнює числа у змінних `a` та `b`. Якщо обидва
// значення більше `100`, то виведи в консоль максимальне з них. В протилежному
// випадку у консолі повинна бути сума значення `b` та числа 512.
//
// --- your code here ---
// const a = 120;
// const b = 180;
// --- end of code ---
//
// ## Example 5 - Форматування посилання (endsWith)
//
// Напиши скрипт який перевіряє чи закінчується значення змінної `link`
// символом `/`. Якщо ні, додай до кінця значення `link` цей символ. Використовуй
// конструкцію `if...else`.
//
// --- your code here ---
// let link = 'https://my-site.com/about';
//
// console.log(link);
// --- end of code ---
//
// ## Example 6 - Форматування посилання (includes та логічне «І»)
//
// Напиши скрипт який перевіряє чи закінчується значення змінної `link`
// символом `/`. Якщо ні, додай до кінця значення `link` цей символ, але тільки в
// тому випадку, якщо в `link` є підрядок `"my-site"`. Використовуй конструкцію
// `if...else`.
//
// --- your code here ---
// let link = 'https://somesite.com/about';
//
// console.log(link);
// --- end of code ---
//
// ## Example 7 - Форматування посилання (тернарний оператор)
//
// Виконай рефакторинг коду задачі номер 6, використовуючи тернарний оператор.
//
// --- your code here ---
// let link = 'https://somesite.com/about';
//
// console.log(link);
// --- end of code ---
//
// ## Example 8 - if...else та логічні оператори
//
// Напиши скрипт який виводитиме в консоль браузера рядок залежно від
// значення змінної `hours`.
//
// Якщо значення змінної `hours`:
//
// - менше `17`, виводь рядок `"Pending"`
// - більше або дорівнює `17` і менше або дорівнює 24, виводь рядок `"Expires"`
// - більше `24` , виводь рядок `"Overdue"`
//
// --- your code here ---
// const hours = 10;
// --- end of code ---
//
// ## Example 9 - Дедлайн здачі проекту (if...else)
//
// Напиши скрипт для відображення часу дедлайну здачі проекту. Використовуй
// конструкцію `if...else`.
//
// - Якщо до дедлайну 0 днів - виведи рядок `"Сьогодні"`
// - Якщо до дедлайну 1 день - виведи рядок `"Завтра"`
// - Якщо до дедлайну 2 дні - виведи рядок `"Післязавтра"`
// - Якщо до дедлайну 3+ днів - виведи рядок `"Дата у майбутньому"`
//
// --- your code here ---
// const daysUntilDeadline = 5;
// --- end of code ---
//
// ## Example 10 - Дедлайн здачі проекту (switch)
//
// Виконай рефакторинг коду задачі номер 9 використовуючи `switch`.
//
// --- your code here ---
// const daysUntilDeadline = 5;
// --- end of code ---
//
// ## Example 11 - Цикл for
//
// Напиши цикл for, який виводить у консоль браузера числа за зростанням від `min`
// до `max`, але тільки якщо число кратне `5`.
//
// --- your code here ---
// const max = 100;
// const min = 20;
// --- end of code ---
//
// ## Example 12 - Введення користувача та розгалуження
//
// Напиши скрипт, який питатиме логін за допомогою `prompt` та логувати
// результат у консоль браузера.
//
// - Якщо відвідувач вводить `"бандерівець2023"`, то `prompt` далі запитує гасло
// - Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок `"Скасовано"`
// - В іншому випадку вивести рядок `"Ви хто такі? я вас не кликав!"`
//
// Пароль перевіряти так:
//
// - Якщо введено пароль `"Слава Україні"`, то вивести рядок `"Героям Слава!"`
// - Інакше виводити рядок `"Вийди розбійник!"`
