// - Урок 12
// 1. Створити модальне вікно яке буде відкриватися при кліку на кнопку всередині тега ******************body.****************** Модальне вікно має закриватися при кліку на напівпрозорий оверлей, та на іконку хрестика всередині модалки
// 2. Додати в модалку логіку закриття при натисканні на кнопку **Escape**
// 3. Створити форму реєстрації користувача за допомогою js де буде 2 поля 
//     1. Поле логіна
//     2. Поле пароль
//     3. Захаркодити вірні логін і пароль в константах
//     4. Додати логіку сабміта форми, при сабміті перевіряємо введені логін і пароль.
//         1. Якщо логін і пароль співпадають - видаляємо форму з документа і показуємо **h2**  з написом **“Вхід успішний”**
//         2. Якщо логі і пароль не співпадають з даними з констант в пункті 3с - показуємо під формою помилку червоним кольором **“Логін або пароль не вірні”**